Статистика работы механизмов/Конфигурация/DataProcessors/_СверкаСБанком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_СверкаСБанком</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключитьСчетаУчетКоторыхВедетсяВДругойСистеме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КаталогиСверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Банки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Каталог</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БанковскиеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Банки</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>35</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлу</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатСверки</Name>
							<Comment>Значения перечислены в соответствии РезультатыСверки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальныйОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приход</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расход</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечныйОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальныйОстатокБанк</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриходБанк</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходБанк</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечныйОстатокБанк</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_СверкаСБанком/Forms/Форма/Ext/Form/Module.bsl
#Область События_формы_и_элементов

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	// Заполняем данные сверки
	
	Объект.Организация			= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Объект.Период.ДатаНачала	= ТекущаяДата() - 86400;
	Объект.Период.ДатаОкончания	= КонецДня(Объект.Период.ДатаНачала);
	
	Объект.ИсключитьСчетаУчетКоторыхВедетсяВДругойСистеме = Истина;
	
	ЗаполнитьДанныеСверки();
	
	// Параметры формы по умолчанию
	
	ЭтаФорма.ОтображатьСверенные = Истина;

	// Доступность реквизитов и команд в зависимости от прав
	
	Элементы.КомандаОтладкаКоманд.Видимость	= РаботаСПользователями.ЭтоПолноправныйПользователь();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	НастроитьВидимостьДоступность(ЭтаФорма);
	
	ЗаполнитьКоманднуюПанельТаблицБанковскихСчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПериодаПриИзменении(Элемент)
	
	Если ЭтаФорма.ВидПериода = "" Тогда
		
		ПриИзмененииПериодаСверки();	
		
	Иначе
		
		ЗаполнитьШаблоныКаталогов();
		НастроитьВидимостьДоступность(ЭтаФорма);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ПриИзмененииПериодаСверки();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьСверенныеПриИзменении(Элемент)

	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьСчетаУчетКоторыхВедетсяВДругойСистемеПриИзменении(Элемент)

	ЗаполнитьДанныеСверки();
	
	ЗаполнитьКоманднуюПанельТаблицБанковскихСчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПутьКДаннымБанкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	КаталогБанка = ПолучитьСтрокуКаталогаБанка(Элемент, Объект);
	
	ДиалогВыбораКаталога                    = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталога.Каталог            = КаталогБанка.Каталог;
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;
	ДиалогВыбораКаталога.Заголовок	        = "Выберите каталог с данными банка";
	
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		КаталогБанка.Каталог = ДиалогВыбораКаталога.Каталог;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПутьКДаннымБанкаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КаталогБанка = ПолучитьСтрокуКаталогаБанка(Элемент, Объект);
	
	// Если сверка за период, то в каталогах будут указаны шаблоны, поэтому их нельзя открыть
	
	Если ПустаяСтрока(КаталогБанка.Каталог) ИЛИ КонецДня(Объект.Период.ДатаНачала) <> КонецДня(Объект.Период.ДатаОкончания) Тогда
		Возврат;
	КонецЕсли;
	
	Каталоги = СтрРазделить(КаталогБанка.Каталог, ";", Ложь);
	
	Если Каталоги.Количество() = 0 Тогда
		
		Возврат;	
		
	ИначеЕсли Каталоги.Количество() = 1 Тогда
		
		Каталог = Каталоги[0];
		
	Иначе
		
		Меню = Новый СписокЗначений;
		Меню.ЗагрузитьЗначения(Каталоги);
		
		ВыбранноеЗначение = ВыбратьИзМеню(Меню, Элемент);
		Если ВыбранноеЗначение = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Каталог = ВыбранноеЗначение.Значение;
		
	КонецЕсли;
	
	ОписаниеКаталога = Новый Файл(СокрЛП(Каталог));
	
	Если ОписаниеКаталога.Существует() Тогда
		ЗапуститьПриложение(ОписаниеКаталога.ПолноеИмя);	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось открыть каталог [" + ОписаниеКаталога.ПолноеИмя + "]. Каталог не существует или отсутствуют права на его просмотр.", ЭтотОбъект, Элемент.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_БанковскиеСчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если СтрЗаканчиваетсяНа(Поле.Имя, "БанковскийСчет") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ОткрытьЗначение(Элемент.ТекущиеДанные.БанковскийСчет);
		
	ИначеЕсли СтрЗаканчиваетсяНа(Поле.Имя, "ИмяФайла") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ПутьКФайлу) Тогда
		
			ЗапуститьПриложение(Элемент.ТекущиеДанные.ПутьКФайлу);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_БанковскиеСчетаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// При программном изменении табличной части отбор нужно переустанавливать
	
	Элемент.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура(Элемент.ОтборСтрок));
		
	ЗаполнитьИтоговыеРезультатыСверкиБанка(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_БанковскиеСчетаРезультатСверкиПриИзменении(Элемент)

	ТекущаяТаблица	= ЭтаФорма.ТекущийЭлемент;
	РезультатСверки = ТекущаяТаблица.ТекущиеДанные.РезультатСверки;
	Сверен			= (РезультатСверки = ЭтаФорма.ВариантыЗначенийРезультатаСверки.Сверено.Значение);
	
	Для Каждого ВыделеннаяСтрока Из ТекущаяТаблица.ВыделенныеСтроки Цикл
		СтрокаСчета = Объект.БанковскиеСчета.НайтиПоИдентификатору(ВыделеннаяСтрока);
		СтрокаСчета.РезультатСверки	= РезультатСверки;
		СтрокаСчета.Сверен			= Сверен;
	КонецЦикла;	
			
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт

	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	ЗаполнитьДанныеСверки();
	
	ЗаполнитьКоманднуюПанельТаблицБанковскихСчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнитьСверку(Команда)

	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьСверку();
	
	ЗаполнитьКоманднуюПанельТаблицБанковскихСчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПерейтиКФайлу(Команда)

	ТекущиеДанные = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.ПутьКФайлу) Тогда
		
		ЗапуститьПриложение("explorer /select," + ТекущиеДанные.ПутьКФайлу);			
	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРасшифроватьРасчет(Команда)

	Если ПустаяСтрока(ЭтаФорма.АдресРасшифровки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед формированием расшифровки необходимо выполнить сверку");
		Возврат;	
	КонецЕсли;
	
	Если Команда.ИспользуемаяТаблица = Неопределено Тогда
		ТекущиеДанные = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	Иначе
		ТекущиеДанные = Команда.ИспользуемаяТаблица.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		РасшифровкаРасчета = СформироватьРасшифровкуРасчета(ТекущиеДанные.Банк, ТекущиеДанные.БанковскийСчет, ЭтаФорма.АдресРасшифровки);			
		
		Если ТипЗнч(РасшифровкаРасчета) = Тип("ТабличныйДокумент") Тогда
			
			РасшифровкаРасчета.Показать(СтрШаблон("%1 за %2", ТекущиеДанные.БанковскийСчет, ПредставлениеПериода(Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания)));	
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВвестиПериод(Команда)

	ДиалогВыбораПериода = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогВыбораПериода.Период.ДатаНачала		= Объект.Период.ДатаНачала;
	ДиалогВыбораПериода.Период.ДатаОкончания	= Объект.Период.ДатаОкончания;
	
	Если ДиалогВыбораПериода.Редактировать() Тогда 
		Объект.Период.ДатаНачала	= ДиалогВыбораПериода.Период.ДатаНачала;
		Объект.Период.ДатаОкончания	= ДиалогВыбораПериода.Период.ДатаОкончания;
		
		ПриИзмененииПериодаСверки();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаСформироватьОтчетОРезультатахСверки(Команда)

	Если ПустаяСтрока(ЭтаФорма.АдресРасшифровки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед формированием отчета необходимо выполнить сверку");
		Возврат;	
	КонецЕсли;
	
	Отчет = СформироватьОтчетОРезультатахСверки();
	
	Если ТипЗнч(Отчет) = Тип("ТабличныйДокумент") Тогда
		
		Отчет.ОтображатьСетку	  = Ложь;
		Отчет.ОтображатьЗаголовки = Ложь;
		Отчет.ТолькоПросмотр	  = Истина;
		
		Отчет.Показать("Сверка за " + ПредставлениеПериода(Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьРезультатыСверки(Команда)

	Если ПустаяСтрока(ЭтаФорма.АдресРасшифровки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед фиксацией результатов необходимо выполнить сверку");
		Возврат;	
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Объект", ЭтаФорма.Объект);
	
	ОткрытьФорму("ВнешняяОбработка._СверкаСБанком.Форма.ФормаСохраненияРезультатовСверки", ПараметрыФормы, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьДанныеСверки()
	
	// Очищаем старую расшифровку расчета
	
	РасшифровкаРасчета = Новый Структура;	
	
	Если ЭтоАдресВременногоХранилища(ЭтаФорма.АдресРасшифровки) Тогда
		УдалитьИзВременногоХранилища(ЭтаФорма.АдресРасшифровки);
	КонецЕсли;
	
	ЭтаФорма.АдресРасшифровки = Неопределено;
	
	// Заполняем данные сверки и обновляем форму
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Если Не ОбработкаОбъект.ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли;
	
	ОбработкаОбъект.ЗаполнитьДанныеСверки();

	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
	ОбновитьОтображениеДанныхОбъекта(ОбработкаОбъект);
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьСверку()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Если Не ОбработкаОбъект.ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли;
	
	// Очищаем старую расшифровку расчета
	
	РасшифровкаРасчета = Новый Структура;	
	
	Если ЭтоАдресВременногоХранилища(ЭтаФорма.АдресРасшифровки) Тогда
		УдалитьИзВременногоХранилища(ЭтаФорма.АдресРасшифровки);
	КонецЕсли;
	
	ЭтаФорма.АдресРасшифровки = Неопределено;
	
	// Выполняем сверку
	
	ОбработкаОбъект.ВыполнитьСверку(, , Ложь, РасшифровкаРасчета);

	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
	ОбновитьОтображениеДанныхОбъекта(ОбработкаОбъект);	
	
	// Запоминаем полученную расшифровку расчета 
	
	Если ЗначениеЗаполнено(РасшифровкаРасчета) Тогда
		ЭтаФорма.АдресРасшифровки = ПоместитьВоВременноеХранилище(РасшифровкаРасчета, ЭтаФорма.УникальныйИдентификатор);	
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Ложь;
	
КонецПроцедуры

#Область Служебные_и_вспомогательные_функции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(Форма)
	
	Элементы = Форма.Элементы;
	Объект	 = Форма.Объект;
	
	// Отображаем "заглушку", если нет данных для сверки
	
	Элементы.ДекорацияНетДанных.Видимость = (Объект.КаталогиСверки.Количество() = 0); 	
	
	// Вариант выбора периода сверки
	
	СверкаЗаДень = (Форма.ВидПериода = ""); 
	
	Элементы.День.Видимость							= СверкаЗаДень;
	Элементы.ГруппаПериодИнтервал.Видимость			= Не СверкаЗаДень; 
	Элементы.СохранитьРезультатыСверки.Доступность	= СверкаЗаДень; // Фиксация сверки доступна только за день
	
	// Корректируем отбор строк в зависимости от настроек формы
	
	Для Каждого СтраницаБанка Из Элементы.СтраницыБанков.ПодчиненныеЭлементы Цикл
		
		Для Каждого ЭлементыСтраницы Из СтраницаБанка.ПодчиненныеЭлементы Цикл
			
			Если ТипЗнч(ЭлементыСтраницы) = Тип("ТаблицаФормы") И СтрНачинаетсяС(ЭлементыСтраницы.Имя, "БанковскиеСчетаБанка") Тогда
				
				ОтборСтрок = Новый Структура;
				
				Для Каждого ЭлементОтбора Из ЭлементыСтраницы.ОтборСтрок Цикл
					Если ЭлементОтбора.Ключ <> "Сверен" Тогда
						ОтборСтрок.Вставить(ЭлементОтбора.Ключ, ЭлементОтбора.Значение); 	
					КонецЕсли;
				КонецЦикла;
				
				Если Не Форма.ОтображатьСверенные Тогда
					ОтборСтрок.Вставить("Сверен", Ложь);	
				КонецЕсли;
				
				ЭлементыСтраницы.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПериодаСверки()
	
	Если ЭтаФорма.ВидПериода = "" Тогда // День
		Объект.Период.ДатаОкончания = КонецДня(Объект.Период.ДатаНачала);
	КонецЕсли;	
	
	ЗаполнитьДанныеСверки();
	
	ЗаполнитьКоманднуюПанельТаблицБанковскихСчетов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШаблоныКаталогов()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		
	ОбработкаОбъект.ЗаполнитьШаблоныКаталогов();

	// Если значение перобразовать в объект, то очищаются добавленные на форме реквизиты,
	// например, Объект.КаталогиСверки.ИмяЭлементаКаталога
	
	Для Каждого СтрокаКаталога Из Объект.КаталогиСверки Цикл
		
		СтрокаШаблона = ОбработкаОбъект.КаталогиСверки.Найти(СтрокаКаталога.Банк, "Банк");
		
		СтрокаКаталога.Каталог = ?(СтрокаШаблона = Неопределено, Неопределено, СтрокаШаблона.Каталог);
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКоманднуюПанельТаблицБанковскихСчетов()
	
	// Как изменить стандартные команды по другому не нашел
	
	Для Каждого СтраницаБанка Из Элементы.СтраницыБанков.ПодчиненныеЭлементы Цикл
		
		Для Каждого ЭлементыСтраницы Из СтраницаБанка.ПодчиненныеЭлементы Цикл
			
			Если ТипЗнч(ЭлементыСтраницы) = Тип("ТаблицаФормы") И СтрНачинаетсяС(ЭлементыСтраницы.Имя, "БанковскиеСчетаБанка") Тогда
				
				ЗаполнитьКоманднуюПанельТаблицыБанковскихСчетов(ЭлементыСтраницы);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьКоманднуюПанельТаблицыБанковскихСчетов(ТаблицаБанковскихСчетов)
	
	Для Каждого ЭлементКоманднойПанели Из ТаблицаБанковскихСчетов.КоманднаяПанель.ПодчиненныеЭлементы Цикл
		
		Если СтрЗаканчиваетсяНа(ЭлементКоманднойПанели.Имя, "Изменить") Тогда
			
			ЭлементКоманднойПанели.Видимость = Ложь;	
		
		ИначеЕсли Найти(ЭлементКоманднойПанели.Имя, "ЗакончитьРедактирование") Тогда
			
			ЭлементКоманднойПанели.Видимость = Ложь;	
			
		ИначеЕсли Найти(ЭлементКоманднойПанели.Имя, "Найти") Тогда
			
			ЭлементКоманднойПанели.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанелиИВДополнительномПодменю;
			ЭлементКоманднойПанели.Отображение	= ОтображениеКнопки.КартинкаИТекст;
			ЭлементКоманднойПанели.Заголовок	= "Поиск";
			
		ИначеЕсли Найти(ЭлементКоманднойПанели.Имя, "ОтменитьПоиск") Тогда
			
			ЭлементКоманднойПанели.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанелиИВДополнительномПодменю;	
			ЭлементКоманднойПанели.Отображение = ОтображениеКнопки.Картинка;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеДанныхОбъекта(ОбработкаОбъект)
	
	ЭтаФорма.ВариантыЗначенийРезультатаСверки = ОбработкаОбъект.ВариантыЗначенийРезультатаСверки();
	
	// Заполним имя файла по полному имени, определим сверенные счета
	
	Для Каждого СтрокаСчета Из Объект.БанковскиеСчета Цикл
		
		Если ЗначениеЗаполнено(СтрокаСчета.ПутьКФайлу) Тогда
			Файл = Новый Файл(СтрокаСчета.ПутьКФайлу);
			СтрокаСчета.ИмяФайла = Файл.Имя;
		Иначе
			СтрокаСчета.ИмяФайла = Неопределено;
		КонецЕсли;
		
		СтрокаСчета.РезультатСверкиАвто = СтрокаСчета.РезультатСверки;
		СтрокаСчета.Сверен				= (СтрокаСчета.РезультатСверки = ЭтаФорма.ВариантыЗначенийРезультатаСверки.Сверено.Значение);
		
	КонецЦикла;
	
	// Удалим старые команды
	
	ПрефиксКоманд = "ПодключаемаяКоманда_";
	
	МассивНаУдаление = Новый Массив;
    Для Каждого Элемент Из Команды Цикл
		Если СтрНачинаетсяС(Элемент.Имя, ПрефиксКоманд) Тогда
			МассивНаУдаление.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Элемент Из МассивНаУдаление Цикл
        Команды.Удалить(Элемент);
	КонецЦикла;
	
	// Удалим старые элементы управления
	
	МассивНаУдаление = Новый Массив;
    Для Каждого Элемент Из Элементы.СтраницыБанков.ПодчиненныеЭлементы Цикл
        МассивНаУдаление.Добавить(Элемент);
    КонецЦикла; 
    Для Каждого Элемент Из Элементы.ГруппаКаталоги.ПодчиненныеЭлементы Цикл
        МассивНаУдаление.Добавить(Элемент);
	КонецЦикла;
	Для Каждого Элемент Из МассивНаУдаление Цикл
        Элементы.Удалить(Элемент);
	КонецЦикла;
	
	// Удалим ненужное условное оформление
	
	ПрефиксПредставленияУсловногоОформления = "Программное оформление результата сверки";
	
	МассивНаУдаление = Новый Массив;
    Для Каждого Элемент Из УсловноеОформление.Элементы Цикл
		Если СтрНачинаетсяС(Элемент.Представление, ПрефиксПредставленияУсловногоОформления) Тогда
			МассивНаУдаление.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Элемент Из МассивНаУдаление Цикл
        УсловноеОформление.Элементы.Удалить(Элемент);
	КонецЦикла;
		
	// Создадим элементы управления
	
	УсловноеОформлениеРезультатаСверки	= Неопределено;
	ПредставленияБанков					= ПолучитьПредставленияБанков(Объект.КаталогиСверки.Выгрузить(Неопределено, "Банк"), Объект.Период.ДатаОкончания);
	
	Для Каждого СтрокаКаталога Из Объект.КаталогиСверки Цикл
		
		ПредставлениеБанка = ПредставленияБанков.Найти(СтрокаКаталога.Банк, "Банк").Представление;
		
		// Пути к каталогу
		
		НовыйЭлемент = Элементы.Добавить("КаталогБанка" + СтрокаКаталога.НомерСтроки, Тип("ПолеФормы"), Элементы.ГруппаКаталоги);
		НовыйЭлемент.ПутьКДанным			= "Объект.КаталогиСверки[" + (СтрокаКаталога.НомерСтроки - 1) + "].Каталог";
		НовыйЭлемент.Вид					= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.КнопкаВыбора			= Истина;
		НовыйЭлемент.КнопкаОткрытия			= Истина;
		НовыйЭлемент.Заголовок				= ПредставлениеБанка;
		
		НовыйЭлемент.УстановитьДействие("НачалоВыбора",	"Подключаемый_ПутьКДаннымБанкаНачалоВыбора");
		НовыйЭлемент.УстановитьДействие("Открытие",		"Подключаемый_ПутьКДаннымБанкаОткрытие");
		
		СтрокаКаталога.ИмяЭлементаКаталога = НовыйЭлемент.Имя;
		
		// Банковские счета
		
		СтраницаБанка = Элементы.Добавить("СтраницаБанка" + СтрокаКаталога.НомерСтроки, Тип("ГруппаФормы"), Элементы.СтраницыБанков);
		СтраницаБанка.Заголовок = ПредставлениеБанка;
		
		СтрокаКаталога.ИмяЭлементаСтраницы = СтраницаБанка.Имя;
		
		ЭлементСчетаБанка = Элементы.Добавить("БанковскиеСчетаБанка" + СтрокаКаталога.НомерСтроки, Тип("ТаблицаФормы"), СтраницаБанка);
		ЭлементСчетаБанка.ПутьКДанным					= "Объект.БанковскиеСчета";
		ЭлементСчетаБанка.ИзменятьСоставСтрок			= Ложь;
		ЭлементСчетаБанка.ИзменятьПорядокСтрок			= Ложь;
		ЭлементСчетаБанка.ОтборСтрок					= Новый ФиксированнаяСтруктура(Новый Структура("Банк", СтрокаКаталога.Банк));
		
		ЭлементСчетаБанка.УстановитьДействие("Выбор",							"Подключаемый_БанковскиеСчетаВыбор");
		ЭлементСчетаБанка.УстановитьДействие("ПриОкончанииРедактирования",		"Подключаемый_БанковскиеСчетаПриОкончанииРедактирования");
		
		КнопкаМенюПерейтиКФайлу = Элементы.Добавить(ЭлементСчетаБанка.Имя + "МенюПерейтиКФайлу", Тип("КнопкаФормы"), ЭлементСчетаБанка.КонтекстноеМеню);
		КнопкаМенюПерейтиКФайлу.ИмяКоманды = "ПерейтиКФайлу";
		
		КомандаРасшифроватьРасчет = Команды.Добавить(ПрефиксКоманд + ЭлементСчетаБанка.Имя + "РасшифроватьРасчет");
		КомандаРасшифроватьРасчет.Заголовок				= Команды.РасшифроватьРасчет.Заголовок;
		КомандаРасшифроватьРасчет.Действие				= Команды.РасшифроватьРасчет.Действие;
		КомандаРасшифроватьРасчет.ИспользуемаяТаблица	= ЭлементСчетаБанка;
		
		КнопкаПанелиРасшифроватьРасчет = Элементы.Добавить(ЭлементСчетаБанка.Имя + "ПанельРасшифроватьРасчет", Тип("КнопкаФормы"), ЭлементСчетаБанка.КоманднаяПанель);
		КнопкаПанелиРасшифроватьРасчет.ИмяКоманды = КомандаРасшифроватьРасчет.Имя;		
		
		КнопкаМенюРасшифроватьРасчет = Элементы.Добавить(ЭлементСчетаБанка.Имя + "МенюРасшифроватьРасчет", Тип("КнопкаФормы"), ЭлементСчетаБанка.КонтекстноеМеню);
		КнопкаМенюРасшифроватьРасчет.ИмяКоманды = "РасшифроватьРасчет";
		
		ГруппаБанковскийСчет = Элементы.Добавить(ЭлементСчетаБанка.Имя + "ГруппаБанковскийСчет", Тип("ГруппаФормы"), ЭлементСчетаБанка);
		
		ЭлементБанковскийСчет = Элементы.Добавить(ЭлементСчетаБанка.Имя + "БанковскийСчет", Тип("ПолеФормы"), ГруппаБанковскийСчет);
		ЭлементБанковскийСчет.ПутьКДанным				= "Объект.БанковскиеСчета.БанковскийСчет";
		ЭлементБанковскийСчет.Заголовок					= "Банковский счет";
		ЭлементБанковскийСчет.Ширина					= 30;
		
		ЭлементИмяФайла = Элементы.Добавить(ЭлементСчетаБанка.Имя + "ИмяФайла", Тип("ПолеФормы"), ГруппаБанковскийСчет);
		ЭлементИмяФайла.ПутьКДанным					= "Объект.БанковскиеСчета.ИмяФайла";
		ЭлементИмяФайла.Заголовок					= "Имя файла";
		ЭлементИмяФайла.ГиперссылкаЯчейки			= Истина;
		ЭлементИмяФайла.ЦветТекста					= ЦветаСтиля.НеактуальнаяСтрокаВСпискеЦвет;
		
		ГруппаНачальныйОстаток = Элементы.Добавить(ЭлементСчетаБанка.Имя + "ГруппаНачальныйОстаток", Тип("ГруппаФормы"), ЭлементСчетаБанка);
		
		ЭлементНачальныйОстаток = Элементы.Добавить(ЭлементСчетаБанка.Имя + "НачальныйОстаток", Тип("ПолеФормы"), ГруппаНачальныйОстаток);
		ЭлементНачальныйОстаток.ПутьКДанным				= "Объект.БанковскиеСчета.НачальныйОстаток";
		ЭлементНачальныйОстаток.Заголовок				= "Нач. остаток";
		
		ЭлементНачальныйОстатокБанк = Элементы.Добавить(ЭлементСчетаБанка.Имя + "НачальныйОстатокБанк", Тип("ПолеФормы"), ГруппаНачальныйОстаток);
		ЭлементНачальныйОстатокБанк.ПутьКДанным			= "Объект.БанковскиеСчета.НачальныйОстатокБанк";
		ЭлементНачальныйОстатокБанк.Заголовок			= "Нач. остаток (банк)";
		
		ГруппаПриход = Элементы.Добавить(ЭлементСчетаБанка.Имя + "ГруппаПриход", Тип("ГруппаФормы"), ЭлементСчетаБанка);
		
		ЭлементПриход = Элементы.Добавить(ЭлементСчетаБанка.Имя + "Приход", Тип("ПолеФормы"), ГруппаПриход);
		ЭлементПриход.ПутьКДанным						= "Объект.БанковскиеСчета.Приход";
		ЭлементПриход.Заголовок							= "Приход";
		
		ЭлементПриходБанк = Элементы.Добавить(ЭлементСчетаБанка.Имя + "ПриходБанк", Тип("ПолеФормы"), ГруппаПриход);
		ЭлементПриходБанк.ПутьКДанным					= "Объект.БанковскиеСчета.ПриходБанк";
		ЭлементПриходБанк.Заголовок						= "Приход (банк)";
		
		ГруппаРасход = Элементы.Добавить(ЭлементСчетаБанка.Имя + "ГруппаРасход", Тип("ГруппаФормы"), ЭлементСчетаБанка);
		
		ЭлементРасход = Элементы.Добавить(ЭлементСчетаБанка.Имя + "Расход", Тип("ПолеФормы"), ГруппаРасход);
		ЭлементРасход.ПутьКДанным						= "Объект.БанковскиеСчета.Расход";
		ЭлементРасход.Заголовок							= "Расход";
		
		ЭлементРасходБанк = Элементы.Добавить(ЭлементСчетаБанка.Имя + "РасходБанк", Тип("ПолеФормы"), ГруппаРасход);
		ЭлементРасходБанк.ПутьКДанным					= "Объект.БанковскиеСчета.РасходБанк";
		ЭлементРасходБанк.Заголовок						= "Расход (банк)";
		
		ГруппаКонечныйОстаток = Элементы.Добавить(ЭлементСчетаБанка.Имя + "ГруппаКонечныйОстаток", Тип("ГруппаФормы"), ЭлементСчетаБанка);
		
		ЭлементКонечныйОстаток = Элементы.Добавить(ЭлементСчетаБанка.Имя + "КонечныйОстаток", Тип("ПолеФормы"), ГруппаКонечныйОстаток);
		ЭлементКонечныйОстаток.ПутьКДанным				= "Объект.БанковскиеСчета.КонечныйОстаток";
		ЭлементКонечныйОстаток.Заголовок				= "Кон. остаток";
		
		ЭлементКонечныйОстатокБанк = Элементы.Добавить(ЭлементСчетаБанка.Имя + "КонечныйОстатокБанк", Тип("ПолеФормы"), ГруппаКонечныйОстаток);
		ЭлементКонечныйОстатокБанк.ПутьКДанным				= "Объект.БанковскиеСчета.КонечныйОстатокБанк";
		ЭлементКонечныйОстатокБанк.Заголовок				= "Кон. остаток (банк)";
		
		ГруппаРезультаты = Элементы.Добавить(ЭлементСчетаБанка.Имя + "ГруппаРезультаты", Тип("ГруппаФормы"), ЭлементСчетаБанка);
		ГруппаРезультаты.Группировка					= ГруппировкаКолонок.ВЯчейке;
		
		ЭлементКартинка = Элементы.Добавить(ЭлементСчетаБанка.Имя + "Картинка", Тип("ПолеФормы"), ГруппаРезультаты);
		ЭлементКартинка.ПутьКДанным						= "Объект.БанковскиеСчета.РезультатСверки";
		ЭлементКартинка.Вид								= ВидПоляФормы.ПолеКартинки;
		ЭлементКартинка.ПоложениеЗаголовка				= ПоложениеЗаголовкаЭлементаФормы.Нет;
		ЭлементКартинка.ОтображатьВШапке				= Ложь;
		ЭлементКартинка.КартинкаЗначений				= БиблиотекаКартинок.СтатусыФайлов;
		
		ЭлементРезультатСверки = Элементы.Добавить(ЭлементСчетаБанка.Имя + "РезультатСверки", Тип("ПолеФормы"), ГруппаРезультаты);
		ЭлементРезультатСверки.ПутьКДанным				= "Объект.БанковскиеСчета.РезультатСверки";
		ЭлементРезультатСверки.Заголовок				= "Результат сверки";
		ЭлементРезультатСверки.Вид						= ВидПоляФормы.ПолеВвода;
		ЭлементРезультатСверки.Ширина					= 15;
		ЭлементРезультатСверки.ГоризонтальноеПоложение	= ГоризонтальноеПоложениеЭлемента.Лево;
		ЭлементРезультатСверки.РежимВыбораИзСписка		= Истина;
		
		Для Каждого ВариантЗначения Из ЭтаФорма.ВариантыЗначенийРезультатаСверки Цикл
			ЭлементРезультатСверки.СписокВыбора.Добавить(ВариантЗначения.Значение.Значение, ВариантЗначения.Значение.Представление);
		КонецЦикла;
		
		//ЭлементРезультатСверки.СписокВыбора.СортироватьПоЗначению();
		
		ЭлементРезультатСверки.УстановитьДействие("ПриИзменении", "Подключаемый_БанковскиеСчетаРезультатСверкиПриИзменении");
		
		// Условное оформление результатов сверки
		
		Если УсловноеОформлениеРезультатаСверки = Неопределено Тогда
			
			УсловноеОформлениеРезультатаСверки = Новый Массив;
			
			Для Каждого ВариантЗначения Из ЭтаФорма.ВариантыЗначенийРезультатаСверки Цикл
				
				ОписаниеРезультата = ВариантЗначения.Значение;
				
				ЭлементОформления = УсловноеОформление.Элементы.Добавить();

				ЭлементОформления.Представление = ПрефиксПредставленияУсловногоОформления + " " + ОписаниеРезультата.Представление;
				
				ОтборОформления = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ОтборОформления.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Объект.БанковскиеСчета.РезультатСверки");
				ОтборОформления.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
				ОтборОформления.ПравоеЗначение	= ОписаниеРезультата.Значение;

				ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", ОписаниеРезультата.Представление);
				
				УсловноеОформлениеРезультатаСверки.Добавить(ЭлементОформления.Поля.Элементы);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Для Каждого ЭлементыУсловногоОформления Из УсловноеОформлениеРезультатаСверки Цикл
			ПолеОформления = ЭлементыУсловногоОформления.Добавить();
			ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(ЭлементРезультатСверки.Имя);
		КонецЦикла;
		
	КонецЦикла;

	ЗаполнитьИтоговыеРезультатыСверкиБанка(ЭтаФорма);

	НастроитьВидимостьДоступность(ЭтаФорма);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПредставленияБанков(Банки, Период)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Банки.Банк КАК Банк
		|ПОМЕСТИТЬ _Банки
		|ИЗ
		|	&Банки КАК Банки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Банки.Банк КАК Банк,
		|	Банки.ЮрФизЛицо КАК ЮрФизЛицо
		|ПОМЕСТИТЬ _ЮрЛицаБанков
		|ИЗ
		|	_Банки КАК _Банки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
		|		ПО (Банки.Ссылка = _Банки.Банк)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЮрЛицаБанков.Банк КАК Банк,
		|	ЕСТЬNULL(РеквизитыЮрЛицБанков.СокращенноеНаименование, _ЮрЛицаБанков.Банк) КАК Представление
		|ИЗ
		|	_ЮрЛицаБанков КАК _ЮрЛицаБанков
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				(Подразделение, Язык, ЮрФизЛицо) В
		|					(ВЫБРАТЬ
		|						ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний),
		|						ЗНАЧЕНИЕ(Справочник.Языки.Русский),
		|						_ЮрЛицаБанков.ЮрФизЛицо
		|					ИЗ
		|						_ЮрЛицаБанков)) КАК РеквизитыЮрЛицБанков
		|		ПО (РеквизитыЮрЛицБанков.ЮрФизЛицо = _ЮрЛицаБанков.ЮрФизЛицо)");
	
	Запрос.УстановитьПараметр("Банки",	Банки);
	Запрос.УстановитьПараметр("Период",	Период);
	
	ПредставленияБанков = Запрос.Выполнить().Выгрузить();
	ПредставленияБанков.Индексы.Добавить("Банк");
	
	Возврат ПредставленияБанков;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСтрокуКаталогаБанка(Элемент, Объект)
	
	КаталогБанка = Неопределено;
	
	Для Каждого СтрокаКаталога Из Объект.КаталогиСверки Цикл
		Если СтрокаКаталога.ИмяЭлементаКаталога = Элемент.Имя Тогда
			КаталогБанка = СтрокаКаталога;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если КаталогБанка = Неопределено Тогда
		ВызватьИсключение "Не найден банк, с которым сопоставлен текущий элемент";
	КонецЕсли;
	
	Возврат КаталогБанка; 
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗаполнитьИтоговыеРезультатыСверкиБанка(Форма)
	
	Объект				= Форма.Объект;
	ВариантыЗначений	= Форма.ВариантыЗначенийРезультатаСверки;
	РезультатыСверки	= Новый Соответствие;
	
	// 1. Если было хоть одно расхождение, то расхождение
	// 2. Если нет расхождений, но есть несверенное, то будет не сверено
	// 3. Иначе сверено
	
	Для Каждого СтрокаСчета Из Объект.БанковскиеСчета Цикл
		
		РезультатСверкиБанка = РезультатыСверки[СтрокаСчета.Банк];
		
		Если РезультатСверкиБанка = Неопределено Тогда
			
			РезультатыСверки[СтрокаСчета.Банк] = СтрокаСчета.РезультатСверки;	
			
		ИначеЕсли СтрокаСчета.РезультатСверки = ВариантыЗначений.Расхождения.Значение Тогда
			
			Если РезультатСверкиБанка <> ВариантыЗначений.Расхождения.Значение Тогда
				РезультатыСверки[СтрокаСчета.Банк] = СтрокаСчета.РезультатСверки;
			КонецЕсли;
			
		ИначеЕсли СтрокаСчета.РезультатСверки = ВариантыЗначений.НеСверялось.Значение Тогда
			
			Если РезультатСверкиБанка = ВариантыЗначений.Сверено.Значение Тогда
				РезультатыСверки[СтрокаСчета.Банк] = СтрокаСчета.РезультатСверки;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Заполняем
	
	Для Каждого СтрокаБанка Из Объект.КаталогиСверки Цикл
		
		РезультатСверкиБанка = РезультатыСверки[СтрокаБанка.Банк];
		Если РезультатСверкиБанка = Неопределено Тогда
			РезультатСверкиБанка = ВариантыЗначений.НеСверялось.Значение;
		КонецЕсли;
		
		Если РезультатСверкиБанка = ВариантыЗначений.Сверено.Значение Тогда
			Форма.Элементы[СтрокаБанка.ИмяЭлементаСтраницы].Картинка = БиблиотекаКартинок.ОформлениеКругЗеленый;
		ИначеЕсли РезультатСверкиБанка = ВариантыЗначений.Расхождения.Значение Тогда
			Форма.Элементы[СтрокаБанка.ИмяЭлементаСтраницы].Картинка = БиблиотекаКартинок.ОформлениеКругКрасный;
		Иначе
			Форма.Элементы[СтрокаБанка.ИмяЭлементаСтраницы].Картинка = БиблиотекаКартинок.ОформлениеКругЖелтый;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьРасшифровкуРасчета(Банк, БанковскийСчет, АдресРасшифровки)

	Если Не ЭтоАдресВременногоХранилища(АдресРасшифровки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Адрес расшифровки не является адресом во временном хранилище");
		Возврат Неопределено;
	КонецЕсли;
	
	РасшифровкаРасчета = ПолучитьИзВременногоХранилища(АдресРасшифровки);
	
	Если ТипЗнч(РасшифровкаРасчета) <> Тип("Структура")
		ИЛИ Не РасшифровкаРасчета.Свойство("СчитанныеДанные")
		ИЛИ ТипЗнч(РасшифровкаРасчета.СчитанныеДанные) <> Тип("ТаблицаЗначений")
	Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка получения расшифровки расчета или отсутствуют данные расчета");
		Возврат Неопределено;
	КонецЕсли;
	
	СчитанныеДанныеПоСчету = РасшифровкаРасчета.СчитанныеДанные.Скопировать(Новый Структура("Банк, БанковскийСчет", Банк, БанковскийСчет));
	Если СчитанныеДанныеПоСчету.Колонки.Найти("Дата") <> Неопределено Тогда
		СчитанныеДанныеПоСчету.Сортировать("Дата");
	КонецЕсли;
	
	ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент();
	ПараметрыВывода.Вставить("СобственныйФорматСтрок", Истина);
	
	РаботаСОтчетами.ВывестиТаблицуЗначенийВТабличныйДокумент(ПараметрыВывода, СчитанныеДанныеПоСчету, , , , Истина);
	
	Возврат ПараметрыВывода.ДокументРезультат;	

КонецФункции

&НаСервере
Функция СформироватьОтчетОРезультатахСверки()

	ОбработкаСверки = РеквизитФормыВЗначение("Объект");
	
	Возврат ОбработкаСверки.СформироватьОтчетОРезультатахСверки();
	
КонецФункции

#Область Отладка_команд_дополнительного_отчета_и_обработки

&НаКлиенте
Процедура ВыбратьИВыполнитьКоманду(Команда)
	
	ИмяТипаОбъекта = ИмяТипаОсновногоРеквизитаФормы(ЭтаФорма);
	
	СписокКоманд = ПолучитьСписокКомандНаСервере(ИмяТипаОбъекта);
	
	Если СписокКоманд.Количество() > 0 Тогда
	
		ВыбраннаяКоманда = СписокКоманд.ВыбратьЭлемент("Выполнить команду");
		
		Если Не ВыбраннаяКоманда = Неопределено Тогда
			ВыполнитьКомандуНаСервере(ИмяТипаОбъекта, ВыбраннаяКоманда.Значение);
		КонецЕсли; 	
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В справочнике ""Дополнительные отчеты и обработки"" для данного объекта команды не заданы");
	
	КонецЕсли;	

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокКомандНаСервере(ИмяТипаОбъекта)

	ОбработкаНаСервере = Новый(ИмяТипаОбъекта);	
	
	СписокКоманд = Новый СписокЗначений;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеОтчетыИОбработкиКоманды.НомерСтроки КАК НомерСтроки,
		|	ДополнительныеОтчетыИОбработкиКоманды.Представление КАК Представление,
		|	ДополнительныеОтчетыИОбработкиГруппыПараметров.Имя КАК Имя
		|ИЗ
		|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДополнительныеОтчетыИОбработки.Команды КАК ДополнительныеОтчетыИОбработкиКоманды
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДополнительныеОтчетыИОбработки.ГруппыПараметров КАК ДополнительныеОтчетыИОбработкиГруппыПараметров
		|			ПО ДополнительныеОтчетыИОбработкиКоманды.Ссылка = ДополнительныеОтчетыИОбработкиГруппыПараметров.Ссылка
		|				И ДополнительныеОтчетыИОбработкиКоманды.ГруппаПараметров = ДополнительныеОтчетыИОбработкиГруппыПараметров.Идентификатор
		|		ПО ДополнительныеОтчетыИОбработки.Ссылка = ДополнительныеОтчетыИОбработкиКоманды.Ссылка
		|ГДЕ
		|	ДополнительныеОтчетыИОбработки.ИмяОбъекта = &ИмяОбъекта");
	
	Запрос.УстановитьПараметр("ИмяОбъекта", ОбработкаНаСервере.Метаданные().Имя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
	    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден элемент справочника ""Дополнительные отчеты и обработки""");
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.Представление) Тогда
				Представление = Выборка.Представление + " (" + Выборка.Имя + ")";
				СписокКоманд.Добавить(Выборка.НомерСтроки, Представление);
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
	Возврат СписокКоманд;
	
КонецФункции
 
&НаСервереБезКонтекста
Процедура ВыполнитьКомандуНаСервере(ИмяТипаОбъекта, НомерСтроки)

	ОбработкаНаСервере = Новый(ИмяТипаОбъекта);

	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеОтчетыИОбработкиКоманды.Ссылка КАК Ссылка,
		|	ДополнительныеОтчетыИОбработкиКоманды.Идентификатор КАК Идентификатор,
		|	ДополнительныеОтчетыИОбработкиКоманды.ГруппаПараметров КАК ГруппаПараметров
		|ИЗ
		|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДополнительныеОтчетыИОбработки.Команды КАК ДополнительныеОтчетыИОбработкиКоманды
		|		ПО ДополнительныеОтчетыИОбработки.Ссылка = ДополнительныеОтчетыИОбработкиКоманды.Ссылка
		|ГДЕ
		|	ДополнительныеОтчетыИОбработки.ИмяОбъекта = &ИмяОбъекта
		|	И ДополнительныеОтчетыИОбработкиКоманды.НомерСтроки = &НомерСтроки");
	
	Запрос.УстановитьПараметр("ИмяОбъекта",	 ОбработкаНаСервере.Метаданные().Имя);
	Запрос.УстановитьПараметр("НомерСтроки", НомерСтроки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		ПараметрыКоманды = Новый Структура("ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ГруппаПараметров", Выборка.Ссылка, Выборка.Идентификатор, Выборка.ГруппаПараметров);
		
		ОбработкаНаСервере.ВыполнитьКоманду(Выборка.Идентификатор, ПараметрыКоманды);
	
	КонецЕсли; 

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяТипаОсновногоРеквизитаФормы(Форма)
	
	// Путь к форме содержит имя объекта, по имени получим тип
	
	ТипОбъекта	= Лев(Форма.ИмяФормы, СтрНайти(Форма.ИмяФормы, ".", , , 1) - 1);
	ИмяОбъекта	= Сред(Форма.ИмяФормы, СтрДлина(ТипОбъекта) + 2, СтрНайти(Форма.ИмяФормы, ".", , , 2) - СтрДлина(ТипОбъекта) - 2);
	
	Возврат ТипОбъекта + "Объект." + ИмяОбъекта;
	
КонецФункции

#КонецОбласти

#КонецОбласти
